/*
 * creation date  18 dec 2020
 * last change    21 aug 2021
 * author  artur
 */
using System;

class _AboutAuthors
{
    static void Main()
    {
        Console.WriteLine("***** AboutAuthors_ *****");

        AboutAuthors_Silent();

        Console.ReadLine();
    }
    static void AboutAuthors_Silent()
    {
        Console.WriteLine(">->->->->->->->->->->->->->->->->->->   AboutAuthors_Silent()\n");


        // Для начала об авторах той самой книги (издания 2017-го года), на которой базирована эта энциклопедия:
        //
        //   > Эндрю Троелсен - мужик с 20-летним стажем в нашей индустрии. Изначально он был простым смертным, работав разработчиком,
        //     преподавателем, автором, публичным докладчиком и руководителем команды (в наше время это зовут team leader). Сейчас же он сидит
        //     на месте менеджера платформы больших данных Thomson Reuters Corporation (это канадская конторка, имеющая несколько небоскрёбов)
        //     . В стародавние времена работал с COM (кроссязыковый мост для написания одной программы на нескольких языках. Древний .NET,
        //     в общем), успев выпустить ряд книг о том, как пользоваться этой штукой на C++ (через некую ATL). На данный момент настрочить 9
        //     изданий той книги (в соавторстве с Джепиксом). Из примечательного осталось сказать то, что он получил степень магистра в
        //     области разработки ПО в университете Святого Томаса (крупнейший универ Миннесоты, кстати), и (на момент написания книги)
        //     трудится над получением ещё одной степени магистра по математической лингвистике в Вашингтонском университете
        //   > Филипп Джепикс - обладатель кучи званий от Microsoft, гораздо более активный участник сообщества (у него есть нормальное
        //     публичное фото, в отличие от Троелсена). Его стаж - 30 лет, и он знаком с .NET ещё с самых первых бета-версий (возможно, он и
        //     сам работал над ним). А ещё он является волонтёром Национального Лыжного Патруля


        // Дальше об авторах второй книги, инфа из которой также сильно расширила эту базу знаний
        //
        //   > Андреас Хилленд --- имеет степень в software engineering и в придачу к ней 20-летний опыт разработки
        //   > Винсент Маверик Дурано --- работает software-инженером (ещё это называют software-архитектором). Он уже написал несколько книг
        //     и имеет больше, чем 15 лет опыта разработки
        //   > Джерри Чилберто --- технический консультант по всевозможным Azure, BizTalk, ASP.NET, MVC, WCF и SQД Server
        //   > Эд Прайс --- senior program менеджер в Microsoft. Он ведёт Microsoft'скую техподдержку для Azure, Service Fabric, IoT и
        //     Visual Studio


        Console.WriteLine("<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<   AboutAuthors_Silent()");
    }
}
